 Kaiser 팀 프로젝트
조원 : B189005 권준태, B189007 김봉섭

○ 설계
   - 설계키워드 : NFC, 기숙사, 인증, 점호, 
   - 설계내용 : 현재 기숙사 점호는 사람이 각방을 방문하면서 인원을 체크한다. 그러나 각 방에 NFC리더기를 설치하여 총장 없이 사생이 직접 스마트폰 핸드폰NFC를 이용하여 개인인증을 통해 자동으로 점호를 할 수 있게 한다.
   - 설계계획
     ① 자료수집 : 점호시스템 분석
     ② 기능정의 : 사용자 정보 저장 및 비교, 관리자 모드 설정
     ③ 소스코딩 : 사용자 클래스, 관리자 클래스, 정보확인 클래스 등
     ④ 단위테스트 : 각 클래스의 연관관계가 정상적으로 이루어 지는지 확인
     ⑤ 통합테스트 : 최종적으로 프로그램이 실행되는지 확인
     ⑥ 결과보고 : 결과보고

○ 요구사항
   - 기숙사 자동점호 시스템은 학생이 학번과 비밀번호, 자신의 고유NFC정보를 등록하여 가입한 후 점호 시 방에 설치된 NFC기기에 자신의 고유 NFC 정보를 지니고 있는 스마트폰을 접촉함으로써 점호를 인증한다. 관리자는 시스템에 등록된 학생의 호실, 층 등을 조회할 수 있으며 점호 시 각 방에 누가 있고 없는지를 조회할 수 있다. 학생은 자신의 정보를 확인할 수 있으며, 공지사항, 택배ㆍ우편의 도착 유무를 조회 할 수 있다.
